; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph3 - mode
	image4 - mode
	image2 - mode
	thermograph5 - mode
	spectrograph1 - mode
	image0 - mode
	Star1 - direction
	Star4 - direction
	GroundStation5 - direction
	Star2 - direction
	Star0 - direction
	Star3 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph5)
	(supports instrument2 image4)
	(calibration_target instrument2 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
)
(:goal (and
	(pointing satellite0 Star9)
	(have_image Phenomenon6 image2)
	(have_image Phenomenon6 image0)
	(have_image Phenomenon7 image4)
	(have_image Phenomenon7 spectrograph1)
	(have_image Star8 spectrograph3)
	(have_image Star8 spectrograph1)
	(have_image Star9 spectrograph3)
	(have_image Phenomenon10 thermograph5)
	(have_image Phenomenon10 spectrograph1)
	(have_image Star11 image4)
	(have_image Star12 image4)
	(have_image Star12 image0)
	(have_image Planet13 image4)
))

)

; plan
1. (turn_to satellite1 star0 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star0)
   goals met: 0 of 14
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 14
3. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 14
4. (turn_to satellite1 star9 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star9)
   goals met: 0 of 14
5. (take_image satellite1 star9 instrument1 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 1 of 14
6. (turn_to satellite1 star8 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star8)
   goals met: 1 of 14
7. (turn_to satellite0 star2 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star2)
   goals met: 1 of 14
8. (take_image satellite1 star8 instrument1 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 2 of 14
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 14
10. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 2 of 14
11. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 14
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 14
13. (turn_to satellite0 phenomenon10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 14
14. (take_image satellite0 phenomenon10 instrument0 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 3 of 14
15. (turn_to satellite0 phenomenon6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 14
16. (take_image satellite0 phenomenon6 instrument0 image0)
   added: (have_image phenomenon6 image0)
   goals met: 4 of 14
17. (take_image satellite0 phenomenon6 instrument0 image2)
   added: (have_image phenomenon6 image2)
   goals met: 5 of 14
18. (turn_to satellite0 phenomenon7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 14
19. (take_image satellite0 phenomenon7 instrument0 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 6 of 14
20. (turn_to satellite0 star12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star12)
   goals met: 6 of 14
21. (take_image satellite0 star12 instrument0 image0)
   added: (have_image star12 image0)
   goals met: 7 of 14
22. (turn_to satellite0 star8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star8)
   goals met: 7 of 14
23. (take_image satellite0 star8 instrument0 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 8 of 14
24. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 9 of 14
25. (turn_to satellite1 star3 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star3)
   goals met: 9 of 14
26. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 9 of 14
27. (turn_to satellite1 phenomenon10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon10)
   goals met: 9 of 14
28. (take_image satellite1 phenomenon10 instrument2 thermograph5)
   added: (have_image phenomenon10 thermograph5)
   goals met: 10 of 14
29. (turn_to satellite1 phenomenon7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon7)
   goals met: 10 of 14
30. (take_image satellite1 phenomenon7 instrument2 image4)
   added: (have_image phenomenon7 image4)
   goals met: 11 of 14
31. (turn_to satellite1 planet13 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet13)
   goals met: 11 of 14
32. (take_image satellite1 planet13 instrument2 image4)
   added: (have_image planet13 image4)
   goals met: 12 of 14
33. (turn_to satellite1 star11 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star11)
   goals met: 12 of 14
34. (take_image satellite1 star11 instrument2 image4)
   added: (have_image star11 image4)
   goals met: 13 of 14
35. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 13 of 14
36. (take_image satellite1 star12 instrument2 image4)
   added: (have_image star12 image4)
   goals met: 14 of 14
